# Reading Data from Different Sources

Pandas contain data structures and data manipulation tools designed for data cleaning and analysis.
<br><br>
                        While pandas adopt much code from NumPy, the difference is that Pandas is designed for tabular, heterogeneous data. NumPy, by difference, is best suited for working with homogeneous numerical array data.<br><br>
                         The name Pandas is derived from the term 'panel data' (an econometrics term for multidimensional structured data sets).

In [3]:
#import pandas

import pandas as pd

<b>Before we start readind the data from different sources. It is important that we upload the  data set to the jupyter notebook.

**1. Read a `.xlsx` file**

In [9]:
# to read a xlsx file
pd.read_excel('employee_info.xlsx')

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

**2. Read a .zip file**

The zipped file contain a .csv file

In [10]:
import zipfile

# Zipfile reads the zipped file
# from the zipped file open the csv as f
# read the csv file
with zipfile.ZipFile('data.zip') as z:
    with z.open('example.csv') as f:
        file = pd.read_csv(f)
        print(file.head())

   Age  Weight (in kg)  Height (in m)
0   45              60           1.35
1   12              43           1.21
2   54              78           1.50
3   26              65           1.21
4   68              50           1.32

**3. Read a `.html` file**

In [21]:
# read the html using read_html()
# header = 1 indicates that the first row contains the headings
# index_col = 0 indicates that the first column contains the index
df_emp = pd.read_html('employee_info.html', header=1, index_col=0)

# print the data
df_emp

[      Male  40,000
 45
 12    Male       0
 54  Female  150000
 26    Male   30000
 64  Female   15000
 21  Female   25600]

**4. Read a `.txt` file**

In [12]:
# read the text file
# sep is the delimiter use
df_demography = pd.read_csv('demography.txt', sep="\t")

# print the head of the data
df_demography.head()

       Country  Birth rate  Life expectancy
0      Vietnam       1.822        74.828244
1      Vanuatu       3.869        70.819488
2        Tonga       3.911        72.150659
3  Timor-Leste       5.578        61.999854
4     Thailand       1.579        73.927659

**5. Read a `.json` file**

In [15]:
# read the file
pd.read_json('iris.json')

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

**6. Read a `.xml` file**

In [16]:
# import the library to xml file
import xml.etree.ElementTree as ET 

# extract the xml file
tree = ET.parse("student_data.xml")
root = tree.getroot() 

# assign column names of the output DataFrame
df_col = ["Name", "Gender", "Marks"]

# create an empty list 
rows = []

for node in root: 
    name = node.attrib.get("name")
    gender = node.find("gender").text if node is not None else None
    marks = node.find("marks").text if node is not None else None
    
    # append each observation in the data to ‘rows’
    rows.append({"Name": name, "Gender": gender, 
                 "Marks": marks})

# create a DataFrame    
df_student = pd.DataFrame(rows, columns = df_col)

# print the DataFrame
df_student

        Name  Gender Marks
0  Student_1  Female   9.5
1  Student_2    Male   8.2
2  Student_3    Male   7.8
3  Student_4  Female   8.5

# Understanding Data

In [23]:
# to read a xlsx file
df1=pd.read_excel('employee_info.xlsx')
df1

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

#### 1)The head() method displays the first five rows of the data

In [24]:
df1.head()

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000

#### 2)The tail() method displays the last five rows of the data

In [25]:
df1.tail()

   Age  Gender  Salary
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

#### 3)Check the dimension of the data using the shape attribute

In [26]:
df1.shape

(6, 3)

#### 4)Check the data type of each variable in the data using the dtypes attribute

In [27]:
df1.dtypes

Age        int64
Gender    object
Salary     int64
dtype: object

#### 5) The info() method returns the information about the shape, data type and null values in the data

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     6 non-null      int64
 1   Gender  6 non-null      object
 2   Salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

# Access elements from the data

#### We can either use the .iloc[], the .loc[] or some conditions to retrieve the elements
#### The .iloc[] allows us to retrieve the rows and columns by position, and the .loc[] allows us to retrieve the elements by the column or row name

In [29]:
df1.iloc[1]

Age         12
Gender    Male
Salary       0
Name: 1, dtype: object

In [31]:
# Gives the age of person in position  0

df1.iloc[0]['Age']

45

In [32]:
# Retrieve the 4th, 5th, and 6th row in the DataFrame using the .iloc[]

df1.iloc[3:6]

   Age  Gender  Salary
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

In [33]:
# The .loc[] selects the data by the label of the rows and column
# Retrieve the gender of the first student using the .loc[]

In [34]:
df1.loc[0]['Gender']

'Male'

In [35]:
df1.loc[[1,2,3],['Age','Salary']]

   Age  Salary
1   12       0
2   54  150000
3   26   30000

In [ ]:
************** THANK YOU *****************************